#' Create config file
#'
#' @param folder way to folder
#'
#'
#' @return Create json for create_disser_frame
#' @export
#'

create_disser_str <- function(folder){
  frame = "
[
  {\"file_name\":\"title\",
  \"name\":\"Титульный лист\",
  \"content\":\"титульный лист\"},

  {\"file_name\":\"intro\",
  \"name\":\"ВВЕДЕНИЕ\",
  \"content\":[
    \"Актуальность исследования\",
    \"Степень разработанности проблемы\",
    \"Цель исследования\",
    \"Задачи исследования\",
    \"Научная новизна\",
    \"Теоретическая практическая значимость\",
    \"Методология методы исследования\",
    \"Основные положения выносимые на защиту\",
    \"Степень достоверности апробация диссертационной работы\",
    \"Внедрение результатов работы практику\",
    \"Личный вклад соискателя\",
    \"Публикации\",
    \"Структура объем диссертаци\"
  ]},

  {\"file_name\":\"chapter_1\",
  \"name\":\"Глава 1\",
  \"content\":[
    \"1. Пункт\",
    \"2. Пункт\"]},

    {\"file_name\":\"chapter_2\",
  \"name\":\"Глава 2\",
  \"content\":[
    \"1. Пункт\",
    \"2. Пункт\"]},

    {\"file_name\":\"chapter_3\",
  \"name\":\"Глава 3\",
  \"content\":[
    \"1. Пункт\",
    \"2. Пункт\"]},

    {\"file_name\":\"conclusion\",
  \"name\":\"ЗАКЛЮЧЕНИЕ\",
  \"content\":[
    \"ЗАКЛЮЧЕНИЕ\",
    \"ВЫВОДЫ\",
    \"ПРАКТИЧЕСКИЕ РЕКОМЕНДАЦИИ\",
    \"СПИСОК СОКРАЩЕНИЙ УСЛОВНЫХ ОБОЗНАЧЕНИЙ\",
    \"СПИСОК ЛИТЕРАТУРЫ\",
    \"ПРИЛОЖЕНИЯ\"]}


]

"
name = paste0(folder,"plan.json")
cat(frame,file = name,append = T)

}
